app/views/users/show.html.erb

SELECT "courses".* FROM "courses" INNER JOIN "registrations" ON "courses"."id" = "registrations"."course_id" WHERE "registrations"."user_id" = $1  [["user_id", 10]]
---
  <div class="card" style="width: 18rem;">
    <% @user.courses.each do |course| %>

SELECT "courses".* FROM "courses" INNER JOIN "registrations" ON "courses"."id" = "registrations"."course_id" WHERE "registrations"."user_id" = $1  [["user_id", 8]]
---
<%else%>
  <% @user.courses.each do |course| %>