app/views/courses/_form.html.erb

    <%= form.label :department_id %>
    <%= form.collection_select :department_id, Department.all, :id, :name %>
---
SELECT "departments".* FROM "departments"