app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def current_user
    @current_user ||= User.find_by(id: session[:user_id]) if logged_in?