app/controllers/courses_controller.rb

INSERT INTO "courses" ("department_id", "code", "title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create

    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save