app/controllers/registrations_controller.rb

SELECT "users".* FROM "users" INNER JOIN "registrations" ON "users"."id" = "registrations"."user_id" WHERE "registrations"."course_id" = $1 AND "users"."is_instructor" = $2  [["course_id", 1], ["is_instructor", false]]
---
  def add_course
    # TODO: Drop course and redirect to @user
    # Reminder: be sure to check if
    # 1) @user is a student
    # 2) @user is NOT registered to the @course

    if @user == current_user
      @course.users << @user unless @user.is_instructor || @course.students.include?(@user)

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_course
    # TODO: find the course using `course_id`
    @course = Course.find(params[:course_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def set_user
    # TODO: find the user using `course_id`
    @user = User.find(params[:user_id])