app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."pennkey" = $1 LIMIT $2  [["pennkey", "b"], ["LIMIT", 1]]
---
  def create
    # TODO: check if user credential match
    # redirect to the user's show page if successful
    # else render the /login form with message "PennKey or Password Incorrect"
    @user = User.find_by(pennkey: params[:pennkey])