app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    @user.password = user_params[:password_hash]

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "pennkey", "is_instructor", "password_hash", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"